Tekla.Structures.DirectManipulation.Model.CreationCommands.ItemTypeProvider
The Tekla.Structures.DirectManipulation.Model.CreationCommands.ItemTypeProvider class provides the creation commands for creating a Tekla.Structures.Model.Brep typed object.

Tekla.Structures.DirectManipulation.Model.CreationCommands.ItemTypeProvider.#ctor
Initializes a new instance of the Tekla.Structures.DirectManipulation.Model.CreationCommands.ItemTypeProvider class.

Tekla.Structures.DirectManipulation.Model.CreationCommands.ItemTypeProvider.Steel
Gets the creation commands for creating a steel item.

Tekla.Structures.DirectManipulation.Model.CreationCommands.ItemTypeProvider.Concrete
Gets the creation commands for creating a concrete item.